![](https://snag.gy/h9Xwf1.jpg)



## Introduction to `pandas`

---

`pandas` is the most popular python package for managing datasets and is used extensively by data scientists.

### Learning Objectives

- Define the anatomy of DataFrames.
- Explore data with DataFrames.
- Practice plotting with pandas.

### Lesson Guide

- What is `pandas`?
- Reading data
- Exploring data
    - Filtering
    - Sorting
- Split-Apply-Combine
- Missing Values

<a id='introduction'></a>

### What is `pandas`?

---

- Data analysis library - **Panel data system** (doesn't actually have to do with the animal, sorry).
- Created by Wes McKinney and Open Sourced by AQR Capital Management, LLC 2009.
- Implemented in highly optimized Python/Cython.
- Most ubiquitous tool used to start data analysis projects within the Python scientific ecosystem.

### Pandas Use Cases

---

- Cleaning data / Munging
- Exploratory Data Analysis (EDA)
- Structuring data for plots or tabular display
- Joining disparate sources
- Filtering, extracting, or transforming

## Importing the Dynamic Trio
From here on out, we'll begin pretty much all of our notebooks with the following three imports.

* **pandas**: The library we'll be using to do pretty much all data manipulation.
* **numpy**: The library we'll need to do various other computations. Even if you don't think you'll need it to start, you'll probably end up using it later.
* **matplotlib**: The library we'll use most for plotting. More on this another day.

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### Discussion: Where do you think a data scientist spends most of their time?

`/poll "Where do you think a data scientist spends most of their time?" "Moving data" "Cleaning data" "Exploring data" "Plotting data" "Predictive modeling" anonymous limit 1`

<a id='loading_csvs'></a>

### Loading a csv into a DataFrame

---

Pandas can load many types of files, but one of the most common filetypes for storing data is in a `.csv` file. Let's load a dataset on UFO sightings from the `./datasets` directory:

In [1]:
pwd

'/Users/sangeetsatpathy/Desktop/general-assembly/106-Pandas-I-main'

In [2]:
!pwd

/Users/sangeetsatpathy/Desktop/general-assembly/106-Pandas-I-main

In [3]:
ufo = pd.read_csv('datasets/ufo.csv')

In [5]:
type(ufo)

pandas.core.frame.DataFrame

This creates a pandas object called a **DataFrame**. These are powerful containers for data with many built-in functions to explore and manipulate data.

We will barely scratch the surface of DataFrame functionality in this lesson, but over the course of this class you will become an expert at using them.

<a id='exploring_data'></a>

## Exploratory Data Analysis (EDA) with Python!

---

DataFrames come with built-in functionality that makes data exploration easy. 

Let's start by looking at the "head" of your data with the `.head()` built-in function. If run alone in a notebook cell, it will show you the first and last handful of columns and the first 5 rows.

In [6]:
ufo.head(7)

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00
5           Valley City             NaN           DISK    ND  9/15/1934 15:30
6           Crater Lake             NaN         CIRCLE    CA   6/15/1935 0:00

If we want to see the last part of our data, we can equivalently use the ```.tail()``` function.

In [9]:
ufo.tail(7)

               City Colors Reported Shape Reported State            Time
80536       Wyoming             RED           DISK    PA  9/4/2014 23:00
80537        Neligh             NaN         CIRCLE    NE  9/4/2014 23:20
80538        Neligh             NaN         CIRCLE    NE  9/4/2014 23:20
80539  Uhrichsville             NaN          LIGHT    OH   9/5/2014 1:14
80540        Tucson        RED BLUE            NaN    AZ   9/5/2014 2:40
80541   Orland park             RED          LIGHT    IL   9/5/2014 3:43
80542      Loughman             NaN          LIGHT    FL   9/5/2014 5:30

<a id='data_dimensions'></a>

### Data dimensions

---

It's good to look at what the dimensions of your data are. The ```.shape``` property will tell you the rows and colum counts of your DataFrame.

In [7]:
ufo.shape #rows, columns

(80543, 5)

`/poll "In terms of rows, is this the largest dataset you've ever worked with?" "Yes" "No" "Not sure, but I'm not impressed anyway" anonymous limit 1`

You will notice that this is operates the same as `.shape` for numpy arrays/matricies. Pandas makes use of numpy under the hood for optimization and speed.

Look at the names of your columns with the ```.columns``` property.

In [11]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

Accessing a specific column is easy. You can use the bracket syntax just like python dictionaries with the string name of the column to extract that column.

In [8]:
ufo['City'].head()

0                  Ithaca
1             Willingboro
2                 Holyoke
3                 Abilene
4    New York Worlds Fair
Name: City, dtype: object

In [9]:
# Try to refrain from doing this...
# THREAD: Why shouldn't you rely on this? (There are several good reasons).
ufo.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
80538                  Neligh
80539            Uhrichsville
80540                  Tucson
80541             Orland park
80542                Loughman
Name: City, Length: 80543, dtype: object

As you can see we can also use the ```.head()``` function on a single column, which is represented as a pandas Series object.

You can also access a column (as a DataFrame instead of a Series) or multiple columns with a list of strings.

In [17]:
ufo[['City', 'Shape Reported']]

                       City Shape Reported
0                    Ithaca       TRIANGLE
1               Willingboro          OTHER
2                   Holyoke           OVAL
3                   Abilene           DISK
4      New York Worlds Fair          LIGHT
...                     ...            ...
80538                Neligh         CIRCLE
80539          Uhrichsville          LIGHT
80540                Tucson            NaN
80541           Orland park          LIGHT
80542              Loughman          LIGHT

[80543 rows x 2 columns]

In [18]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

<a id='dataframe_series'></a>

### DataFrame vs. Series

---

We've been playing with them, so I guess we should define them formally:

* A **`Series`** is a one-dimensional array of values **with an index**.
* A **`DataFrame`** is a two-dimensional array of values **with both a row and column index**.
* It turns out - each column of a `DataFrame` is actually a `Series`!

![](./assets/series-vs-df.png)

There is an important difference between using a list of strings and just a string with a column's name: when you use a list with the string it returns another **DataFrame**, but when you use just the string it returns a pandas **Series** object.

In [19]:
print(type(ufo['City']))
print(type(ufo[['City']]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [20]:
ufo['City'].shape

(80543,)

In [21]:
ufo[['City']].shape

(80543, 1)

<a id='info'></a>

### Examining your data with `.info()`

---

The `.info()` should be the first thing you look at when getting acquainted with a new dataset.

**Types** are very important.  They impact the way data will be represented in our machine learning models, how data can be joined, whether or not math operators can be applied, and when you can encounter unexpected results.

> _Typical problems when working with new datasets_:
> - Missing values
> - Unexpected types (string/object instead of int/float)
> - Dirty data (commas, dollar signs, unexpected characters, etc)
> - Blank values that are actually "non-null" or single white-space characters

`.info()` is a function that is available on every **DataFrame** object. It gives you information about:

- Name of column / variable attribute
- Type of index (RangeIndex is default)
- Count of non-null values by column / attribute
- Type of data contained in column / attribute
- Unqiue counts of dtypes (Pandas data types)
- Memory usage of our dataset

In [10]:
ufo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80543 entries, 0 to 80542
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             80492 non-null  object
 1   Colors Reported  17034 non-null  object
 2   Shape Reported   72141 non-null  object
 3   State            80543 non-null  object
 4   Time             80543 non-null  object
dtypes: object(5)
memory usage: 3.1+ MB

## Aside:  Working with "Big Data"

---

The term **Big Data** has become a little bit of a buzzword with no clear, consensus definition. The most common definition is that **Big Data are data that are too big to fit in your computer's memory.**

![](https://snag.gy/UGNamo.jpg)

The reason that this definition is good is because when your data size exceeds your RAM, you have to use a separate set of tools to solve your problems. For example:

* Spark (Week 7!)
* Hadoop
* Being clever with how you read and use data
    - Separate it into small chunks for example.

<a id='describe'></a>

## Quick Summaries

---

The `.describe()` function is very useful for taking a quick look at your data. It gives you some of the basic descriptive statistics.

You can use `.value_counts()` to get a good tabular view of a categorical variable.

In [14]:
# Let's read in the diamonds data set.
diamonds = pd.read_csv('datasets/diamonds.csv')
diamonds.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [27]:
diamonds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53940 entries, 0 to 53939
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    53940 non-null  float64
 1   cut      53940 non-null  object
 2   color    53940 non-null  object
 3   clarity  53940 non-null  object
 4   depth    53940 non-null  float64
 5   table    53940 non-null  float64
 6   price    53940 non-null  int64
 7   x        53940 non-null  float64
 8   y        53940 non-null  float64
 9   z        53940 non-null  float64
dtypes: float64(6), int64(1), object(3)
memory usage: 4.1+ MB

In [29]:
# Let's describe the price
diamonds['price'].describe()

count    53940.000000
mean      3932.799722
std       3989.439738
min        326.000000
25%        950.000000
50%       2401.000000
75%       5324.250000
max      18823.000000
Name: price, dtype: float64

In [30]:
# We can even do it to the whole DataFrame - what does that look like?
# What's missing?
diamonds.describe()

,carat,depth,table,price,x,y,z
count,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000
mean,0.797940,61.749405,57.457184,3932.799722,5.731157,5.734526,3.538734
std,0.474011,1.432621,2.234491,3989.439738,1.121761,1.142135,0.705699
min,0.200000,43.000000,43.000000,326.000000,0.000000,0.000000,0.000000
25%,0.400000,61.000000,56.000000,950.000000,4.710000,4.720000,2.910000
50%,0.700000,61.800000,57.000000,2401.000000,5.700000,5.710000,3.530000
75%,1.040000,62.500000,59.000000,5324.250000,6.540000,6.540000,4.040000
max,5.010000,79.000000,95.000000,18823.000000,10.740000,58.900000,31.800000

In [31]:
diamonds.describe(include = 'all')

,carat,cut,color,clarity,depth,table,price,x,y,z
count,53940.000000,53940,53940,53940,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000
unique,NaN,5,7,8,NaN,NaN,NaN,NaN,NaN,NaN
top,NaN,Ideal,G,SI1,NaN,NaN,NaN,NaN,NaN,NaN
freq,NaN,21551,11292,13065,NaN,NaN,NaN,NaN,NaN,NaN
mean,0.797940,NaN,NaN,NaN,61.749405,57.457184,3932.799722,5.731157,5.734526,3.538734
std,0.474011,NaN,NaN,NaN,1.432621,2.234491,3989.439738,1.121761,1.142135,0.705699
min,0.200000,NaN,NaN,NaN,43.000000,43.000000,326.000000,0.000000,0.000000,0.000000
25%,0.400000,NaN,NaN,NaN,61.000000,56.000000,950.000000,4.710000,4.720000,2.910000
50%,0.700000,NaN,NaN,NaN,61.800000,57.000000,2401.000000,5.700000,5.710000,3.530000
75%,1.040000,NaN,NaN,NaN,62.500000,59.000000,5324.250000,6.540000,6.540000,4.040000
max,5.010000,NaN,NaN,NaN,79.000000,95.000000,18823.000000,10.740000,58.900000,31.800000

In [32]:
diamonds.describe(include = 'object')

          cut  color clarity
count   53940  53940   53940
unique      5      7       8
top     Ideal      G     SI1
freq    21551  11292   13065

In [33]:
# Let's count up the cuts
diamonds['cut'].value_counts()

cut
Ideal        21551
Premium      13791
Very Good    12082
Good          4906
Fair          1610
Name: count, dtype: int64

In [34]:
# Let's do the same thing, but normalized
diamonds['cut'].value_counts(normalize=True)

cut
Ideal        0.399537
Premium      0.255673
Very Good    0.223990
Good         0.090953
Fair         0.029848
Name: proportion, dtype: float64

```.describe()``` gives us these statistics:

- **count**, which is equivalent to the number of cells (rows)
- **mean**, the average of the values in the column
- **std**, which is the standard deviation
- **min**, the minimum value
- **25%**, the 25th percentile of the values 
- **50%**, the 50th percentile of the values, which is the equivalent to the median
- **75%**, the 75th percentile of the values
- **max**, the maximum value

There are built-in math functions that will work on all of the columns of a DataFrame at once, or subsets of the data.

I can use the `.mean()` function on the `ufo` DataFrame to get the mean for every column.

In [35]:
diamonds['price'].mean()

3932.799721913237

In [15]:
diamonds['price'].quantile(.25)

950.0

In [18]:
diamonds['price'][100]

2760

<a id='independent_practice'></a>

### Now you!

---

Now that we know a little bit about basic DataFrame use, let's practice on a new dataset.

> Pro tip:  You can use the "tab" key to browse filesystem resources when your cursor is in a string to get a relative reference to the files that can be loaded in Jupyter notebook.  Remember, you have to use your arrow keys to navigate the files populated in the UI. 

<img src="https://snag.gy/IlLNm9.jpg">

1. Read in the `cars.csv` dataset. (call it `cars`)
1. What is the mean `mpg` for cars in this dataset?

In [4]:
cars = pd.read_csv('datasets/cars.csv')
cars['mpg'].mean()

20.090625000000003

## Filtering
We usually don't need to operate on the _whole_ dataset. A very common task is to parse it down to only the pieces we need.

In [20]:
cars.head()

    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
1  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
2  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
3  21.4    6  258.0  110  3.08  3.215  19.44   1   0     3     1
4  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2

In [21]:
v = np.array([12, 98, 9, 50, 23])

In [22]:
# What do you think the result of this cell is?
v[[True, False, True, False, True]]

array([12,  9, 23])

In [23]:
# How about this?
v < 40

array([ True, False,  True, False,  True])

In [43]:
# So...
v[v < 40]

array([12,  9, 23])

In [5]:
# And this?
cars['mpg'] > 30

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17     True
18     True
19     True
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27     True
28    False
29    False
30    False
31    False
Name: mpg, dtype: bool

In [24]:
# Finally...
cars[cars['mpg'] > 30]

     mpg  cyl  disp   hp  drat     wt   qsec  vs  am  gear  carb
17  32.4    4  78.7   66  4.08  2.200  19.47   1   1     4     1
18  30.4    4  75.7   52  4.93  1.615  18.52   1   1     4     2
19  33.9    4  71.1   65  4.22  1.835  19.90   1   1     4     1
27  30.4    4  95.1  113  3.77  1.513  16.90   1   1     5     2

Filtering in pandas uses vectors of booleans to describe inclusion or exclusion. `True` means you're in, `False` means you're out.

In [47]:
# This functions identically to the code above, and can sometimes feels a little cleaner.
# Variables that serve this function are sometimes called "masks"
mask = cars['mpg'] > 30
cars[mask]

     mpg  cyl  disp   hp  drat     wt   qsec  vs  am  gear  carb
17  32.4    4  78.7   66  4.08  2.200  19.47   1   1     4     1
18  30.4    4  75.7   52  4.93  1.615  18.52   1   1     4     2
19  33.9    4  71.1   65  4.22  1.835  19.90   1   1     4     1
27  30.4    4  95.1  113  3.77  1.513  16.90   1   1     5     2

### Multiple Filters
Often we want to filter based on multiple conditions. We can use the usual "and" and "or" logic, but the symbols change for mystical (read: annoying) Python reasons.

In [7]:
(cars['hp'] > 100).describe()

count       32
unique       2
top       True
freq        23
Name: hp, dtype: object

In [49]:
# "And" logic - use ampersand (&)
# Note parentheses mandatory!
cars[(cars['mpg'] > 30) & (cars['hp'] > 100)]

     mpg  cyl  disp   hp  drat     wt  qsec  vs  am  gear  carb
27  30.4    4  95.1  113  3.77  1.513  16.9   1   1     5     2

In [51]:
# "Or" logic - use pipe (|)
cars[(cars['mpg'] > 30) | (cars['cyl'] == 4)]

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
2   22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
7   24.4    4  146.7   62  3.69  3.190  20.00   1   0     4     2
8   22.8    4  140.8   95  3.92  3.150  22.90   1   0     4     2
17  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
18  30.4    4   75.7   52  4.93  1.615  18.52   1   1     4     2
19  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1
20  21.5    4  120.1   97  3.70  2.465  20.01   1   0     3     1
25  27.3    4   79.0   66  4.08  1.935  18.90   1   1     4     1
26  26.0    4  120.3   91  4.43  2.140  16.70   0   1     5     2
27  30.4    4   95.1  113  3.77  1.513  16.90   1   1     5     2
31  21.4    4  121.0  109  4.11  2.780  18.60   1   1     4     2

### Now you:

In [25]:
# (THREAD): Show me all the UFO sightings in your hometown! (City and State)
# Anything interesting?
ufo[(ufo['City'] == "Palo Alto")]

            City Colors Reported Shape Reported State              Time
361    Palo Alto             NaN       FIREBALL    CA   6/15/1956 18:00
3259   Palo Alto             NaN          LIGHT    CA    6/22/1976 1:00
18124  Palo Alto             NaN           DISK    CA   12/15/2000 9:00
20919  Palo Alto             NaN            NaN    CA  11/19/2001 11:00
20955  Palo Alto            BLUE           OVAL    CA  11/25/2001 20:45
23286  Palo Alto             NaN          OTHER    CA   9/19/2002 19:35
26357  Palo Alto             NaN          LIGHT    CA   9/23/2003 19:15
26459  Palo Alto             NaN          LIGHT    CA   9/29/2003 19:15
27266  Palo Alto             NaN           DISK    CA  11/28/2003 17:35
30326  Palo Alto             NaN       TRIANGLE    CA    9/12/2004 3:00
31350  Palo Alto             NaN      FORMATION    CA   12/15/2004 5:00
31402  Palo Alto             NaN      FORMATION    CA   12/23/2004 1:00
31848  Palo Alto      GREEN BLUE          LIGHT    CA   2/22/2005 23:45
33081  Palo Alto             NaN         SPHERE    CA    7/3/2005 20:31
34902  Palo Alto             NaN      FORMATION    CA   11/20/2005 2:00
34912  Palo Alto             NaN            NaN    CA  11/20/2005 21:30
39640  Palo Alto             NaN         SPHERE    CA     4/4/2007 6:05
48252  Palo Alto             NaN       FIREBALL    CA   3/11/2009 21:00
50139  Palo Alto             NaN          LIGHT    CA    8/20/2009 0:00
54721  Palo Alto             NaN          OTHER    CA   9/26/2010 22:45
57024  Palo Alto        RED BLUE          LIGHT    CA    5/10/2011 0:00
60544  Palo Alto           GREEN       CYLINDER    CA  12/12/2011 19:19
70451  Palo Alto             NaN       CYLINDER    CA   6/25/2013 16:45
73690  Palo Alto             RED           DISK    CA  10/30/2013 21:20
75410  Palo Alto             NaN      FORMATION    CA   1/11/2014 21:05

### Aside: Some shortcuts

In [55]:
cars[cars['mpg'].between(24, 30)]

     mpg  cyl   disp  hp  drat     wt  qsec  vs  am  gear  carb
7   24.4    4  146.7  62  3.69  3.190  20.0   1   0     4     2
25  27.3    4   79.0  66  4.08  1.935  18.9   1   1     4     1
26  26.0    4  120.3  91  4.43  2.140  16.7   0   1     5     2

In [56]:
cars[~cars['mpg'].between(14, 31)]#tilda negates!

     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
14  10.4    8  472.0  205  2.93  5.250  17.98   0   0     3     4
15  10.4    8  460.0  215  3.00  5.424  17.82   0   0     3     4
17  32.4    4   78.7   66  4.08  2.200  19.47   1   1     4     1
19  33.9    4   71.1   65  4.22  1.835  19.90   1   1     4     1
23  13.3    8  350.0  245  3.73  3.840  15.41   0   0     3     4

In [57]:
ufo[ufo['City'].isin(['Towaco', 'Montville'])]

            City Colors Reported Shape Reported State              Time
1585      Towaco             NaN         CIRCLE    NJ   5/20/1968 19:00
29123  Montville             NaN        VARIOUS    OH   6/10/2004 21:00
34461  Montville             NaN           CONE    OH  10/20/2005 20:00
45630     Towaco             NaN       TRIANGLE    NJ    8/13/2008 1:00
55349  Montville             NaN           DISK    CT  11/10/2010 19:40
71134     Towaco             NaN           OVAL    NJ   7/15/2013 22:00

<a id='indexing'></a>

## Pandas Indexing: `.loc` and `.iloc`

---

So far we've learned how to select both rows and columns. The savvy and skeptical student would have noticed a problem here. We have ambiguous notation! What does this do:

```python
data[something]
```

We can't tell! Is `something` a mask or a string? One selects rows, the other selects columns. **What if we wanted to filter rows and select columns at the same time?!**

Pandas has two properties that you can use for indexing:

- **`.loc`** indexes with the _labels_ for rows and columns axis.
- **`.iloc`** indexes with the _integer positions_ for rows and columns axis.
> There used to be a third, `.ix` which is now deprecated and shan't ever be used again.

## `.loc` is Most Common
The syntax of `.loc` is pretty intuitive:

```python
data.loc[rows, columns]
```

Where `rows` is often a filter (ie, a **mask**), and `columns` is a list of columns, or even just `:` to select all columns.

In [7]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [8]:

mask = ufo['Shape Reported'].isin(['TRIANGLE', 'LIGHT'])
ufo['City'][mask] #this gives same thing, except in SERIES
ufo.loc[mask, 'City':'State'] #This returns it as a DATAFRAME.

                       City Colors Reported Shape Reported State
0                    Ithaca             NaN       TRIANGLE    NY
4      New York Worlds Fair             NaN          LIGHT    NY
10                  Fontana             NaN          LIGHT    CA
22                      NaN             NaN          LIGHT    LA
52                San Deigo             NaN       TRIANGLE    CA
...                     ...             ...            ...   ...
80532              Lawrence             NaN          LIGHT    MA
80534              Burleson             NaN          LIGHT    TX
80539          Uhrichsville             NaN          LIGHT    OH
80541           Orland park             RED          LIGHT    IL
80542              Loughman             NaN          LIGHT    FL

[24148 rows x 4 columns]

In [9]:
mask.head()

0     True
1    False
2    False
3    False
4     True
Name: Shape Reported, dtype: bool

In [46]:
ufo.iloc[5:11, [0, 3]]

           City State
5   Valley City    ND
6   Crater Lake    CA
7          Alma    MI
8       Eklutna    AK
9       Hubbard    OR
10      Fontana    CA

### 
Acccctually.....
![](assets/actually.png)
According to **_The Zen of Python_**, explicit is better than implicit. `.loc` is explicit. **Most people choose to always use `.loc` instead of the ambiguous `data[something]` notation! This is a pretty good idea! When in doubt, use `.loc`!**

### `.iloc` is rare, but useful
The `i` stands for "integer" and will give you the actual zero-indexed numerical indices.

## Sorting

In [47]:
# We can sort individual Series...
diamonds['price'].sort_values(ascending = False)

27749    18823
27748    18818
27747    18806
27746    18804
27745    18803
         ...
4          335
3          334
2          327
1          326
0          326
Name: price, Length: 53940, dtype: int64

In [48]:
# Or the entire DataFrame
diamonds.sort_values('price', ascending = False) # Doesn't affect original dataframe.

       carat        cut color clarity  depth  table  price     x     y     z
27749   2.29    Premium     I     VS2   60.8   60.0  18823  8.50  8.47  5.16
27748   2.00  Very Good     G     SI1   63.5   56.0  18818  7.90  7.97  5.04
27747   1.51      Ideal     G      IF   61.7   55.0  18806  7.37  7.41  4.56
27746   2.07      Ideal     G     SI2   62.5   55.0  18804  8.20  8.13  5.11
27745   2.00  Very Good     H     SI1   62.8   57.0  18803  7.95  8.00  5.01
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
4       0.31       Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
3       0.29    Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
2       0.23       Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
1       0.21    Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
0       0.23      Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43

[53940 rows x 10 columns]

In [49]:
diamonds

       carat        cut color clarity  depth  table  price     x     y     z
0       0.23      Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1       0.21    Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2       0.23       Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3       0.29    Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4       0.31       Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
53935   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
53936   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
53937   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
53938   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
53939   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

[53940 rows x 10 columns]

### Now You:

In [72]:
ufo.Time = pd.to_datetime(ufo.Time)

In [73]:
ufo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80543 entries, 0 to 80542
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             80492 non-null  object
 1   Colors Reported  17034 non-null  object
 2   Shape Reported   72141 non-null  object
 3   State            80543 non-null  object
 4   Time             80543 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(4)
memory usage: 3.1+ MB

In [54]:
ufo.sort_values('Time',ascending=False)

                 City Colors Reported Shape Reported State            Time
72447       San Diego             NaN          LIGHT    CA   9/9/2013 9:51
72446       Struthers             NaN            NaN    OH   9/9/2013 3:00
72465  Ft. Lauderdale             RED           OVAL    FL  9/9/2013 23:30
72464           Starr             RED        DIAMOND    SC  9/9/2013 23:00
72463          Edmond             RED          CIGAR    OK  9/9/2013 23:00
...               ...             ...            ...   ...             ...
118        Mount Hope             NaN            NaN    WV  1/1/1950 22:00
32            Ft. Lee             NaN          CIGAR    VA  1/1/1945 12:00
25          San Diego             NaN          CIGAR    CA  1/1/1944 12:00
26         Wilderness             NaN           DISK    WV  1/1/1944 12:00
24         Wilderness             NaN           DISK    WV  1/1/1944 10:00

[80543 rows x 5 columns]

In [55]:
# Give me the 5 most recent UFO sightings in Roswell, New Mexico.
# You'll need to filter and use .sort_values()
# This is a hard one!
ufo.sort_values('Time',ascending=False).iloc[0:5,:]

                 City Colors Reported Shape Reported State            Time
72447       San Diego             NaN          LIGHT    CA   9/9/2013 9:51
72446       Struthers             NaN            NaN    OH   9/9/2013 3:00
72465  Ft. Lauderdale             RED           OVAL    FL  9/9/2013 23:30
72464           Starr             RED        DIAMOND    SC  9/9/2013 23:00
72463          Edmond             RED          CIGAR    OK  9/9/2013 23:00

## Split-Apply-Combine

---

What if we want summary statistics _with respect to some categorical variable?_ For example, the price of a diamond probably varies widely between different diamond cuts. To tackle this problem, we'll use the **Split-Apply-Combine** technique. (This is sometimes called **MapReduce**, but is more of a special case of MapReduce). 

* **Split**: Separate your data into different DataFrames, one for each category.
* **Apply**: On each split-up DataFrame, apply some function or transformation (for example, the mean).
* **Combine**: Take the results and combine the split-up DataFrames back into one aggregate DataFrame.

This might sound complicated, but it's actually only two commands in pandas (the **Combine** step is done for us).

In [66]:
diamonds.groupby('cut').head() #gets the first 5 of EACH category, not just the first 5 original; but in order.

     carat        cut color clarity  depth  table  price     x     y     z
0     0.23      Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1     0.21    Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2     0.23       Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3     0.29    Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4     0.31       Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
5     0.24  Very Good     J    VVS2   62.8   57.0    336  3.94  3.96  2.48
6     0.24  Very Good     I    VVS1   62.3   57.0    336  3.95  3.98  2.47
7     0.26  Very Good     H     SI1   61.9   55.0    337  4.07  4.11  2.53
8     0.22       Fair     E     VS2   65.1   61.0    337  3.87  3.78  2.49
9     0.23  Very Good     H     VS1   59.4   61.0    338  4.00  4.05  2.39
10    0.30       Good     J     SI1   64.0   55.0    339  4.25  4.28  2.73
11    0.23      Ideal     J     VS1   62.8   56.0    340  3.93  3.90  2.46
12    0.22    Premium     F     SI1   60.4   61.0    342  3.88  3.84  2.33
13    0.31      Ideal     J     SI2   62.2   54.0    344  4.35  4.37  2.71
14    0.20    Premium     E     SI2   60.2   62.0    345  3.79  3.75  2.27
15    0.32    Premium     E      I1   60.9   58.0    345  4.38  4.42  2.68
16    0.30      Ideal     I     SI2   62.0   54.0    348  4.31  4.34  2.68
17    0.30       Good     J     SI1   63.4   54.0    351  4.23  4.29  2.70
18    0.30       Good     J     SI1   63.8   56.0    351  4.23  4.26  2.71
19    0.30  Very Good     J     SI1   62.7   59.0    351  4.21  4.27  2.66
39    0.33      Ideal     I     SI2   61.8   55.0    403  4.49  4.51  2.78
91    0.86       Fair     E     SI2   55.1   69.0   2757  6.45  6.33  3.52
97    0.96       Fair     F     SI2   66.3   62.0   2759  6.27  5.95  4.07
123   0.70       Fair     F     VS2   64.5   57.0   2762  5.57  5.53  3.58
124   0.70       Fair     F     VS2   65.3   55.0   2762  5.63  5.58  3.66

In [65]:
diamonds.head() #gets first 5 only.

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [69]:
# What is the mean price by diamond cut?
diamonds.groupby('cut')['price'].mean()

cut
Fair         4358.757764
Good         3928.864452
Ideal        3457.541970
Premium      4584.257704
Very Good    3981.759891
Name: price, dtype: float64

In [67]:
pd.read_sql()

TypeError: read_sql() missing 2 required positional arguments: 'sql' and 'con'

In [81]:
# Can we just describe each price by cut?
diamonds.groupby('cut')['price'].describe().T

cut            Fair          Good         Ideal       Premium     Very Good
count   1610.000000   4906.000000  21551.000000  13791.000000  12082.000000
mean    4358.757764   3928.864452   3457.541970   4584.257704   3981.759891
std     3560.386612   3681.589584   3808.401172   4349.204961   3935.862161
min      337.000000    327.000000    326.000000    326.000000    336.000000
25%     2050.250000   1145.000000    878.000000   1046.000000    912.000000
50%     3282.000000   3050.500000   1810.000000   3185.000000   2648.000000
75%     5205.500000   5028.000000   4678.500000   6296.000000   5372.750000
max    18574.000000  18788.000000  18806.000000  18823.000000  18818.000000

In [88]:
# What if I want my own recipe of statistics?
diamonds.groupby('cut')['price'].agg(['mean', 'max', 'min', np.std]).sort_values('mean')

                  mean    max  min          std
cut
Ideal      3457.541970  18806  326  3808.401172
Good       3928.864452  18788  327  3681.589584
Very Good  3981.759891  18818  336  3935.862161
Fair       4358.757764  18574  337  3560.386612
Premium    4584.257704  18823  326  4349.204961

### Now You:
What is the mean miles per gallon for each cylinder size?

### Advanced Split-Apply-Combining
Feel free to skip!

In [89]:
# What if I want my own home-spun aggregate function?

# Maybe the mean of the log-price is interesting to you?
def log_mean(p):
    return np.mean(np.log(p))

diamonds.groupby('cut')['price'].agg(['count', 'mean', log_mean])

           count         mean  log_mean
cut
Fair        1610  4358.757764  8.093441
Good        4906  3928.864452  7.842809
Ideal      21551  3457.541970  7.639467
Premium    13791  4584.257704  7.950795
Very Good  12082  3981.759891  7.798664

In [91]:
# What if I want functions of different columns?
diamonds.groupby('cut').agg({
    'price': ['mean', 'std'],
    'carat': ['max']
})

                 price              carat
                  mean          std   max
cut
Fair       4358.757764  3560.386612  5.01
Good       3928.864452  3681.589584  3.01
Ideal      3457.541970  3808.401172  3.50
Premium    4584.257704  4349.204961  4.01
Very Good  3981.759891  3935.862161  4.00

## Adding, Dropping, Renaming, and `inplace` Methods

In [ ]:
# Adding a column is easy, just define it!
# What if I wanted km per gal instead of miles per gal?

In [ ]:
# Oops - that actually doesn't make sense since they'd be using liters anyway.
# Let's drop it.

In [ ]:
# But... it's not gone?

###  Inplace Methods!
There are several methods in pandas that don't "stick" unless you tell them to. These methods will always have `inplace=False` by default. If you want to run a method and have it "stick" - assign `inplace=True`.

For example...

### Renaming Columns

In [71]:
# Yuck - I hate spaces and capital letters
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [ ]:
# Lowercaseifying is easy:
# The "columns" attribute of a DataFrame works just like a numpy array or Series.

In [75]:
ufo.rename(columns={'Shape Reported':'shape'}, inplace=True)

In [ ]:
# The .rename method

In [76]:
ufo.head()

                   City Colors Reported     shape State             Time
0                Ithaca             NaN  TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN     OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN      OVAL    CO  2/15/1931 14:00
3               Abilene             NaN      DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN     LIGHT    NY  4/18/1933 19:00

### Aside: `str` and `dt` methods
There are a lot of familiar string and date operations we can perform on columns. Strangely, they exist within a pandas submodule and so have to be prefixed with `str` and `dt` respectively.

In [82]:
ufo['shape'].head()

0    TRIANGLE
1       OTHER
2        OVAL
3        DISK
4       LIGHT
Name: shape, dtype: object

In [81]:
ufo['shape'].str.replace('O', 'BRO').head()

0    TRIANGLE
1     BROTHER
2      BROVAL
3        DISK
4       LIGHT
Name: shape, dtype: object

In [ ]:
# We already did this above, but datetime variables need to be converted specially.
# ufo['time'] = pd.to_datetime(ufo['time'])
ufo['time'].dt.year.head()

## Missing Values

In [86]:
s = pd.Series([5, 7, np.nan, 2, 10])

In [87]:
s

0     5.0
1     7.0
2     NaN
3     2.0
4    10.0
dtype: float64

In [ ]:
# Hmm...

In [93]:
s[s.notnull()]

0     5.0
1     7.0
3     2.0
4    10.0
dtype: float64

In [ ]:
# Easy way to filter out missings!

## Exporting Data
We can read data, but how do we save it so we can send it out? pandas has several methods of the form `.to_*()`.

<a id='review'></a>

### Review

---

 - What would we do with a dataset when we first acquire it?
 - What's important to consider when first looking at a dataset? 
 - What are some common problems we can run into with new data?
 - What are some common operations with DataFrames?
 - How do we slice? Index? Filter?

# EXTRA MATERIALS
![](assets/biohazard.png)
Everything that follows is considered advanced or "too much" for our first session with pandas, and may not be explicitly covered by the instructor. If the instructor _does_ cover it, please don't worry that you don't understand this on your first pass.

**THAT DOES NOT MEAN THESE TOPICS ARE UNIMPORTANT OR RARELY USED!** We highly _highly_ recommend you take a look at these on your own time.

### Merging

In [94]:
movies = pd.read_csv(
    'datasets/movies.tbl',
    sep='|',
    encoding='latin1',
    header=None,
    names=['movie_id', 'title'],
    usecols=[0, 1]
)
movies.head()

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

In [95]:
ratings = pd.read_csv(
    'datasets/movie_ratings.tsv',
    sep='\t',
    header=None,
    names=['user_id', 'movie_id', 'rating', 'timestamp']
)
ratings.head()

   user_id  movie_id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [98]:
movie_reviews = pd.merge(ratings, movies, how='left')
movie_reviews.head()

   user_id  movie_id  rating  timestamp                       title
0      196       242       3  881250949                Kolya (1996)
1      186       302       3  891717742    L.A. Confidential (1997)
2       22       377       1  878887116         Heavyweights (1994)
3      244        51       2  880606923  Legends of the Fall (1994)
4      166       346       1  886397596         Jackie Brown (1997)

In [ ]:
print(movies.shape)
print(ratings.shape)
print(movie_reviews.shape)

### "Categorical" Variables
Despite the name, when pandas says "Categorical", they really mean "Ordinal" - that is, ordered categories.

For example, check out the following crosstab:

In [ ]:
pd.crosstab(diamonds['cut'], diamonds['color'])

The "cuts" are not in the right order! They're actually in alphabetical order. We can fix this by telling pandas that there really is an important ordering here.

In [ ]:
diamonds['cut'] = pd.Categorical(diamonds['cut'], categories=['Fair', 'Good', 'Very Good', 'Premium', 'Ideal'])
pd.crosstab(diamonds['cut'], diamonds['color'])

### Categorizing with `.map()`

In [ ]:
cars['cyl_word'] = cars['cyl'].map({4: 'Four', 6: 'Six', 8: 'Eight'})
cars['cyl_word'].value_counts()

In [ ]:
def is_efficient(x):
    if x > 20:
        return "Efficient"
    else:
        return "Wasteful"
    
cars['fuel_economy'] = cars['mpg'].map(is_efficient)
cars['fuel_economy'].value_counts()

### Advanced Data Manipulation with `.apply()`
The `.apply()` method is very similar to `.map()`, except more advanced. You can apply a function along any axis of a `DataFrame`. `.apply()` is our "Swiss army knife" for data manipulation - if something can't be solved with ordinary means, it might be time for a `.apply()`.

In [ ]:
sizes = pd.Series([8, 4, 5, 'L', 2, 12, 16, 8, 'XL'])

In [ ]:
def to_num(x):
    try:
        out = float(x)
    except:
        out = np.nan
    return out

In [ ]:
sizes.apply(to_num)

In [ ]:
cars.head()

In [ ]:
def describe_car(row):
    efficiency = row['fuel_economy'].lower()
    cyl = row['cyl_word'].lower()
    auto = 'automatic' if row['am'] == 1 else 'manual'
    print(f"This {cyl} cylinder car has {auto} transmission and a(n) {efficiency} fuel economy.")

In [ ]:
cars.head().apply(describe_car, axis=1)

BONUS QUESTION: Why are there 5 "None" valus in the above output?